Revit 2027 API
BuiltInFailures.SteelElementFailures.SteelElementModifyParametersTaskNotFinished Property
 Cannot modify parameters while background calculations are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementModifyParametersTaskNotFinished { get; }
Public Shared ReadOnly Property SteelElementModifyParametersTaskNotFinished As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementModifyParametersTaskNotFinished {
	FailureDefinitionId^ get ();
}
static member SteelElementModifyParametersTaskNotFinished : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace